"""사용자 입력에서 추출할 검색 메타데이터 허용값입니다."""

PARTY_TYPES = [
    "보행자",
    "자동차",
    "자전거",
]

LOCATIONS = [
    "횡단보도 내",
    "횡단보도 부근",
    "횡단시설 부근[보20~보21]",
    "횡단보도 없음",
    "기타 사고유형 [보29~보36]",
    "양쪽 신호등 있는 교차로",
    "한쪽 신호등 있는 교차로",
    "한쪽 지시표지 있는 교차로",
    "교차로 노면 표시 위반 사고",
    "신호등 없는 교차로",
    "교차로 부근 동시 우회전 내지 좌회전 사고",
    "중앙선 침범 사고",
    "중앙선 없거나 중앙선침범 미적용 도로에서 교행 사고",
    "직진차와 유턴차 사이의 사고",
    "안전거리미확보로 인한 추돌사고",
    "주정차 차량 추돌사고",
    "진로변경 사고",
    "도로로 진입하는 차와 직진차와의 사고",
    "앞지르기 금지 장소에서 추월사고",
    "선행 유턴 대 후행 유턴 사고",
    "정차 후 출발 대 직진 사고",
    "낙하물 사고",
    "주차장 사고",
    "문 열림 사고",
    "횡단보도 횡단 차량",
    "회전교차로 사고",
    "긴급자동차 사고",
    "동일차로 통행 중 사고",
    "자전거 도로횡단 사고",
    "자전거횡단도로 횡단사고",
    "자전거 도로 사고",
]

